DataProcessors/ЗагрузкаЗаявокАварийноДиспетчерскойСлужбы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЗаявокАварийноДиспетчерскойСлужбы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МашиноМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>МашиноМеста</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерМашиноМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМашиноМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗаявокНаПроведенияРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокНаПроведенияРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аварийная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийЗаявокНаПроведениеРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаявокНаПроведениеРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроведениеРаботПоЗданию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведениеРаботПоЛицевомуСчету</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСтатусовЗаявкиНаПроведениеРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыСтатусовЗаявкиНаПроведениеРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаПроведениеРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПроведениеРемонта</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокНаПроведенияРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаявокНаПроведениеРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУдобноеДляЗаказчика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФактическогоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПоВыполнениюЗаявки</Name>
					<Comment>Комментарий по выполнению заявки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПроведениеРемонта</Name>
					<Comment>Ответственный за проведение ремонта (мастер)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаПроведенияРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОценокПроведенияРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовЗаявкиНаПроведениеРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗагрузкаЗаявокАварийноДиспетчерскойСлужбы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Готово(Команда)
	#Если Не ВебКлиент Тогда
	
	ТекФайл = Новый Файл(Объект.ИмяФайлаДанных);
	Расширение = ТекФайл.Расширение;
	
	Если НРег(СокрЛП(Расширение)) = ".xml" Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ТекФайл.ПолноеИмя);
		
		СписокНужныхДанных = Новый Структура;
		СписокНужныхДанных.Вставить("number",);
		СписокНужныхДанных.Вставить("date",);
		СписокНужныхДанных.Вставить("status",);
		СписокНужныхДанных.Вставить("text",);
		СписокНужныхДанных.Вставить("title",);
		СписокНужныхДанных.Вставить("category");
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					Если ЧтениеXML.Имя = "filedate" Тогда
						ДатаДокумента = ЧтениеXML.Значение;
					КонецЕсли;
					
					ИмяАтрибута =  ЧтениеXML.Имя;
					Атрибут = ЧтениеXML.Значение;
					
					Если ИмяАтрибута = "number" Тогда
						СписокНужныхДанных.number = Атрибут;
					ИначеЕсли ИмяАтрибута = "date" Тогда
						СписокНужныхДанных.date = Атрибут;
					ИначеЕсли ИмяАтрибута = "status" Тогда
						СписокНужныхДанных.status = ПроверитьСтатусНаСервере(Атрибут);
					ИначеЕсли ИмяАтрибута = "text" Тогда
						СписокНужныхДанных.text = Атрибут;
					ИначеЕсли ИмяАтрибута = "title" Тогда
						СписокНужныхДанных.title = Атрибут;
					ИначеЕсли ИмяАтрибута = "category" Тогда
						СписокНужныхДанных.category = ПолучитьВидЗаявки(Атрибут);
					ИначеЕсли  ИмяАтрибута = "user" Тогда
						НоваяСтрока = ТаблицаДляЗагрузки.Добавить();
						
						НоваяСтрока.НомерДокумента = СписокНужныхДанных.number;
						НоваяСтрока.ДатаДокумента = СписокНужныхДанных.date;
						НоваяСтрока.СтатусЗаявки = СписокНужныхДанных.status;
						НоваяСтрока.ТекстЗаявки = СписокНужныхДанных.text;
						НоваяСтрока.ЗаголовокЗаявки = СписокНужныхДанных.title;
						НоваяСтрока.ЛицевойСчет = ПолучитьЛицевойСчет(Атрибут);
						НоваяСтрока.ВидЗаявки = СписокНужныхДанных.category;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если ТаблицаДляЗагрузки.Количество() > 0 Тогда
			СоздатьЗаявкуДляАС();
		КонецЕсли;
	КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидЗаявки(Атрибут)
	Если Атрибут = "Обычная" Тогда
		Возврат Перечисления.ВидыЗаявокНаПроведенияРемонта.Обычная;
	Иначе
		Возврат Перечисления.ВидыЗаявокНаПроведенияРемонта.Аварийная;
	КонецЕсли;
КонецФункции // ПолучитьВидЗаявки()
 

&НаСервере
Процедура СоздатьЗаявкуДляАС()
	Для каждого Строка Из ТаблицаДляЗагрузки Цикл
		Ссылка = Документы.ЗаявкаНаПроведениеРемонта.НайтиПоНомеру(Строка.НомерДокумента,ДатаДокумента);
		
		НовыйДокумент = ?(ПустаяСтрока(Ссылка),Документы.ЗаявкаНаПроведениеРемонта.СоздатьДокумент(),Ссылка.ПолучитьОбъект());
		
		Если ПустаяСтрока(Ссылка) Тогда
			НовыйДокумент.Дата = ?(Строка.ДатаДокумента = Дата(0001,01,01,00,00,00), ДатаДокумента, Строка.ДатаДокумента);
			НовыйДокумент.Номер = Строка.НомерДокумента;
			НовыйДокумент.Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		НовыйДокумент.АвторПоследнегоИзменения = ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.ДатаПоследнегоИзменения = ТекущаяДата();
		НовыйДокумент.ЛицевойСчет = Строка.ЛицевойСчет;
		НовыйДокумент.СтатусЗаявки = Строка.СтатусЗаявки;
		НовыйДокумент.ТекстЗаявки = Строка.ТекстЗаявки;
		НовыйДокумент.Здание = Строка.ЛицевойСчет.Владелец;
		НовыйДокумент.ВидЗаявки = Строка.ВидЗаявки;
		НовыйДокумент.Организация = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация"); 
		НовыйДокумент.Заказчик = ОпределитьОтветственногоВладельца(Новый Структура("ЛицевойСчет",Строка.ЛицевойСчет)).ОтветственныйВладелец;
		Если Строка.ЛицевойСчет = Справочники.ЛицевыеСчета.ПустаяСсылка() Тогда
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийЗаявокНаПроведениеРемонта.ПроведениеРаботПоЗданию;
		Иначе	
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийЗаявокНаПроведениеРемонта.ПроведениеРаботПоЛицевомуСчету;
		КонецЕсли; 
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьОтветственногоВладельца(СтруктураДанные)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПрописанных, 0) КАК КоличествоПрописанных,
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка)) КАК ОтветственныйВладелец,
		|	ЕСТЬNULL(МашиноМестаСрезПоследних.НомерМашиноМеста, """") КАК НомерМашиноМеста,
		|	ЕСТЬNULL(МашиноМестаСрезПоследних.КоличествоМашиноМест, 0) КАК КоличествоМашиноМест
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МашиноМеста.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК МашиноМестаСрезПоследних
		|		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = МашиноМестаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует = ИСТИНА";
		
	Запрос.УстановитьПараметр("ЛицевойСчет", СтруктураДанные.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец",	РезультатЗапроса.ОтветственныйВладелец);
		СтруктураДанные.Вставить("КоличествоПрописанных",	РезультатЗапроса.КоличествоПрописанных);
		СтруктураДанные.Вставить("КоличествоПроживающих",	РезультатЗапроса.КоличествоПроживающих);
		СтруктураДанные.Вставить("НомерМашиноМеста",			РезультатЗапроса.НомерМашиноМеста);
		СтруктураДанные.Вставить("КоличествоМашиноМест",		РезультатЗапроса.КоличествоМашиноМест);
		
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец",	Справочники.ПотребителиУслуг.ПустаяСсылка());
		СтруктураДанные.Вставить("КоличествоПрописанных",	0);
		СтруктураДанные.Вставить("КоличествоПроживающих",	0);
		СтруктураДанные.Вставить("НомерМашиноМеста",			"");
		СтруктураДанные.Вставить("КоличествоМашиноМест",		0);
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция ПроверитьСтатусНаСервере(Атрибут)
	Если Атрибут = "5" Тогда
		Статус = Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.НоваяЗаявка;
	ИначеЕсли Атрибут = "6" ИЛИ Атрибут = "7" Тогда
		Статус = Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Принята;
	ИначеЕсли Атрибут = "8" ИЛИ Атрибут = "9" Тогда
		Статус = Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Выполнена;
	КонецЕсли;
	
	Возврат Статус;
КонецФункции // ()

&НаСервере
Функция ПолучитьЛицевойСчет(Атрибут)
	Возврат Справочники.ЛицевыеСчета.НайтиПоНаименованию(Атрибут);
КонецФункции // ПолучитьЛицевойСчет()
 
&НаКлиенте
Процедура ВыборФайла(Элемент, ПроверятьСуществование=Ложь, Знач РасширениеПоУмолчанию = "xml", 
	АрхивироватьФайлДанных = Истина, ВыборФайлаПравил = Ложь)
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр						=	"Файл данных (*.xml)|*.xml";
	ДиалогВыбораФайла.Расширение					=	"xml";
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.ИмяФайлаДанных = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры  //ВыборФайла()

&НаКлиенте
Процедура ПутьКФайлуДляЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	ЗапуститьПриложение("explorer " + Элемент.ТекстРедактирования);
	СтандартнаяОбработка = ЛОЖЬ;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуДляЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ВыборФайла(Элемент, , , );
КонецПроцедуры
